# Region Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelPath..::..Region Property
ModelPath Class See Also
---
The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public string Region { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Region As String
	Get
```

Visual C++
---
```text
public:
property String^ Region {
	String^ get ();
}
```

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace